### Pandas
- rows and columns
- Means PanelData
- one of the data science packages
- Used for data manipulation,analysis and cleaning
- contains mainly 2 data structures in it
    - 1.Series
    - 2.DataFrames
- A series is a sequence of data
- A data frame is a data with rows and columns

In [1]:
import pandas as pd # as means alias 
pd.__version__

'0.25.1'


### syntax:
    - pd.Series(ele)

In [5]:
st='hello word'
print(pd.Series(st))
print(st)

0    hello word
dtype: object
hello word

In [7]:
#conversion of string into series
st2='hi hello hey'.split()
pd.Series(st2)

0       hi
1    hello
2      hey
dtype: object

In [9]:
# conversion of list into series
# we can provide user index
li=[123,'name',9.3]
pd.Series(li,index=('num','string','float'))

num        123
string    name
float      9.3
dtype: object

In [10]:
#conversion of dictionary into series
dic={'key1':123,'key2':'hello','key3':9.3} # 
# 2 values:key & val
pd.Series(dic)

key1      123
key2    hello
key3      9.3
dtype: object

In [11]:
# converting tuple into series
t=('a','b','c','d')
pd.Series(t,index=[1,2,3,4])

1    a
2    b
3    c
4    d
dtype: object

In [12]:
import numpy as np # numpy 
ar=np.arange(4,10) # array
pd.Series(ar) # conversion

0    4
1    5
2    6
3    7
4    8
5    9
dtype: int32

In [18]:
r=np.random.randint(20,40,4)# random matrix
s=pd.Series(r,index=['I','II','III','IV'])
print(s)
for seq in s:
    print(seq)

I      37
II     36
III    24
IV     32
dtype: int32
37
36
24
32

### Converting strings/tuples/lists/dict into DataFrame

In [20]:
st='hey i am ruthu'.split() # 4 words
pd.DataFrame(st)

       0
0    hey
1      i
2     am
3  ruthu

In [21]:
li=[[1,2,3],[4,5,6]] # list of lists [[],[]]
pd.DataFrame(li,index=['list1','list2'])

       0  1  2
list1  1  2  3
list2  4  5  6

In [31]:
dic={'key':['hi'],'key2':['hey'],'key3':'hello'}
print(pd.DataFrame(dic)) # 4 rows
print('........')
#print(pd.DataFrame(dic),index=[1,2,3])

  key key2   key3
0  hi  hey  hello
........

In [33]:
import pandas as pd
dic2={'Names':['first name','second name','third name'],'Marks':[20,23,24],
      'ID':['N130001','N130002','N130003']}
pd.DataFrame(dic2,index=['Stu1','Stu2',3])

            Names  Marks       ID
Stu1   first name     20  N130001
Stu2  second name     23  N130002
3      third name     24  N130003

In [35]:
# create the following DataFrame
''''Stirng  Int  Float
--      --    --
--      --    --
--      --    -- '''
import pandas as pd
dic={"strings":["hi","hello","hey"],"int":[1,2,3],
     "float":[1.2,3.4,5.6]}
pd.DataFrame(dic,index=[1,2,3])

  strings  int  float
1      hi    1    1.2
2   hello    2    3.4
3     hey    3    5.6

In [36]:
md={'String':['hi','hey','hello'],'Integer':[12,56,78],'Folat':[9.2,8.5,7.8]}
d=pd.DataFrame(md)
d

  String  Integer  Folat
0     hi       12    9.2
1    hey       56    8.5
2  hello       78    7.8

In [38]:
dic3={'key':('a','e','i','o','u'),'key2':('b','c','d','p','k')}
pd.DataFrame(dic3)

  key key2
0   a    b
1   e    c
2   i    d
3   o    p
4   u    k

In [39]:
s=pd.Series(np.random.randint(20,40,8))
s

0    24
1    30
2    29
3    36
4    31
5    20
6    38
7    31
dtype: int32

In [40]:
print(s[3])
print(s[3:7])

36
3    36
4    31
5    20
6    38
dtype: int32

In [42]:
s.index=[np.arange(10,18)] # passing array as index to the existed series
s[3:7]

13    36
14    31
15    20
16    38
dtype: int32

### Data Analysis and Manipulation
- analyzing the data
- information means the thing we have in our system/in our 
- data the required information

In [43]:
import pandas as pd
df1=pd.DataFrame({"Int_rate":[2,1,2,3],
                  "Int_gdp":[50,45,45,67]},
                 index=[2041,2002,2003,2204])
df1

      Int_rate  Int_gdp
2041         2       50
2002         1       45
2003         2       45
2204         3       67

In [44]:
df2=pd.DataFrame({"low_tier_hpi":[80,90,70,60],
                  "unemployment":[1,3,5,6]},
                 index=[2001,2003,2002,2005])
df2

      low_tier_hpi  unemployment
2001            80             1
2003            90             3
2002            70             5
2005            60             6

In [45]:
df1.join(df2) # which joins the both DF
df1

      Int_rate  Int_gdp
2041         2       50
2002         1       45
2003         2       45
2204         3       67

In [46]:
df1

      Int_rate  Int_gdp
2041         2       50
2002         1       45
2003         2       45
2204         3       67

In [52]:
df3=pd.DataFrame({"a":[80,90,60,70],
                  "b":[2,1,2,3], # 2 2 3
                  "c":[50,45,45,67]}, # 50 45 67
                 index=[2001,2002,2003,2004])
df3

       a  b   c
2001  80  2  50
2002  90  1  45
2003  60  2  45
2004  70  3  67

In [51]:
df4=pd.DataFrame({"a":[80,69,60,70],
                  "b":[2,1,2,3],
                  "c":[50,45,45,67]},
                 index=[2001,2005,2006,2008])
df4

       a  b   c
2001  80  2  50
2005  69  1  45
2006  60  2  45
2008  70  3  67

In [53]:
 df3.merge(df4) # combining both dataframes

    a  b   c
0  80  2  50
1  60  2  45
2  70  3  67

In [17]:
df3.merge(df4,on='a') # based on a perticular key

    a  b_x  c_x  b_y  c_y
0  80    2   50    2   50
1  60    2   45    2   45
2  70    3   67    3   67

In [54]:
con=pd.concat([df1,df2]) # 
con

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

      Int_gdp  Int_rate  low_tier_hpi  unemployment
2041     50.0       2.0           NaN           NaN
2002     45.0       1.0           NaN           NaN
2003     45.0       2.0           NaN           NaN
2204     67.0       3.0           NaN           NaN
2001      NaN       NaN          80.0           1.0
2003      NaN       NaN          90.0           3.0
2002      NaN       NaN          70.0           5.0
2005      NaN       NaN          60.0           6.0

In [19]:
df1

      Int_rate  Int_gdp
2041         2       50
2002         1       45
2003         2       45
2204         3       67

In [20]:
df2

      low_tier_hpi  unemployment
2001            80             1
2003            90             3
2002            70             5
2005            60             6

In [23]:
dates=pd.date_range('2021-06-01','2021-06-07')
pd.Series(dates,index=['Day1','Day2','Day3','Day4','Day5','Day6','Day7'])

Day1   2021-06-01
Day2   2021-06-02
Day3   2021-06-03
Day4   2021-06-04
Day5   2021-06-05
Day6   2021-06-06
Day7   2021-06-07
dtype: datetime64[ns]

In [32]:
dates2=pd.date_range('2019-10-20',periods=10)
dates2

DatetimeIndex(['2019-10-20', '2019-10-21', '2019-10-22', '2019-10-23',
               '2019-10-24', '2019-10-25', '2019-10-26', '2019-10-27',
               '2019-10-28', '2019-10-29'],
              dtype='datetime64[ns]', freq='D')

In [33]:
temp=pd.Series([32,34,30,37,40,35,40,41,45,39],index=dates2)
temp

2019-10-20    32
2019-10-21    34
2019-10-22    30
2019-10-23    37
2019-10-24    40
2019-10-25    35
2019-10-26    40
2019-10-27    41
2019-10-28    45
2019-10-29    39
Freq: D, dtype: int64

In [34]:
temp[3] # accessing

37

In [35]:
temp.index[2] # 3rd index value of temp series

Timestamp('2019-10-22 00:00:00', freq='D')

In [36]:
df3.columns # list of columns present in our DF

Index(['a', 'b', 'c'], dtype='object')

In [31]:
import numpy as np

In [60]:
a=np.array([['Ram',45,47,41,49],['Asha',29,39,40,50]])
a2=pd.DataFrame(a,columns=['Name','Science','Maths','English',"Social"])
a2.index=["student1","student2"]
a2

          Name Science Maths English Social
student1   Ram      45    47      41     49
student2  Asha      29    39      40     50

In [68]:
marks_df=pd.read_csv('marks.csv') # census data
marks_df

  Name  Maths  Science  English  Social
0    A     98       93       86      70
1    B     74       93       97      99
2    C     94       80       93      80
3    E     85       85       92      97
4    F     86       89       86      98
5    G     99       84       85      90
6    H     86       90       81      90
7    I     91       87       71      73
8    J     91       76       92      86
9    K     78       81       75      95

In [69]:
marks_df.head() # gives the first five rows

  Name  Maths  Science  English  Social
0    A     98       93       86      70
1    B     74       93       97      99
2    C     94       80       93      80
3    E     85       85       92      97
4    F     86       89       86      98

In [41]:
marks_df.tail() # last five rows of data frame

  Name  Maths  Science  English
5    G     87       72       82
6    H     75       87       90
7    I     78       88       81
8    J     79       98       88
9    K     90       87       74

In [42]:
marks_df.head(2) #that many rows of value

  Name  Maths  Science  English
0    A     82       73       76
1    B     82       78       83

In [43]:
marks_df.tail(3) # last 3 samples

  Name  Maths  Science  English
7    I     78       88       81
8    J     79       98       88
9    K     90       87       74

In [70]:
new=pd.read_csv('marks.csv',header=None) # header will be removed
new

       0      1        2        3       4
0   Name  Maths  Science  English  Social
1      A     98       93       86      70
2      B     74       93       97      99
3      C     94       80       93      80
4      E     85       85       92      97
5      F     86       89       86      98
6      G     99       84       85      90
7      H     86       90       81      90
8      I     91       87       71      73
9      J     91       76       92      86
10     K     78       81       75      95

In [78]:
marks_df

  Name  Maths  Science  English  Social
0    A     98       93       86      70
1    B     74       93       97      99
2    C     94       80       93      80
3    E     85       85       92      97
4    F     86       89       86      98
5    G     99       84       85      90
6    H     86       90       81      90
7    I     91       87       71      73
8    J     91       76       92      86
9    K     78       81       75      95

In [72]:
pd.read_csv('marks.csv',usecols=['Name','Maths']) # accessing the perticular colimn values

  Name  Maths
0    A     98
1    B     74
2    C     94
3    E     85
4    F     86
5    G     99
6    H     86
7    I     91
8    J     91
9    K     78

In [73]:
new=pd.read_csv('marks.csv',names=['N','M','S','E']) # renaming the coloumn names
new

          N        M        S       E
Name  Maths  Science  English  Social
A        98       93       86      70
B        74       93       97      99
C        94       80       93      80
E        85       85       92      97
F        86       89       86      98
G        99       84       85      90
H        86       90       81      90
I        91       87       71      73
J        91       76       92      86
K        78       81       75      95

In [52]:
new['M'] # li['M'] #

0     Maths
1        82
2        82
3        75
4        73
5        75
6        87
7        75
8        78
9        79
10       90
Name: M, dtype: object

In [54]:
new[['S','M']]

          S      M
0   Science  Maths
1        73     82
2        78     82
3        81     75
4        88     73
5        88     75
6        72     87
7        87     75
8        88     78
9        98     79
10       87     90

In [55]:
marks_df

  Name  Maths  Science  English
0    A     82       73       76
1    B     82       78       83
2    C     75       81       77
3    E     73       88       82
4    F     75       88       88
5    G     87       72       82
6    H     75       87       90
7    I     78       88       81
8    J     79       98       88
9    K     90       87       74

In [56]:
new.columns# columns in df

Index(['N', 'M', 'S', 'E'], dtype='object')

In [57]:
print(marks_df.info) #

<bound method DataFrame.info of   Name  Maths  Science  English
0    A     82       73       76
1    B     82       78       83
2    C     75       81       77
3    E     73       88       82
4    F     75       88       88
5    G     87       72       82
6    H     75       87       90
7    I     78       88       81
8    J     79       98       88
9    K     90       87       74>

In [74]:
marks_df.describe() # statistics of data

           Maths    Science    English     Social
count  10.000000  10.000000  10.000000  10.000000
mean   88.200000  85.800000  85.800000  87.800000
std     8.080154   5.672546   8.256984  10.411532
min    74.000000  76.000000  71.000000  70.000000
25%    85.250000  81.750000  82.000000  81.500000
50%    88.500000  86.000000  86.000000  90.000000
75%    93.250000  89.750000  92.000000  96.500000
max    99.000000  93.000000  97.000000  99.000000

In [59]:
marks_df.dtypes # object

Name       object
Maths       int64
Science     int64
English     int64
dtype: object

In [75]:
marks_df.index

RangeIndex(start=0, stop=10, step=1)

In [76]:
marks_df.shape  # dimension 10rows and 4 columns

(10, 5)

In [63]:
marks_df.shape[0]# no.of rows

10

In [121]:
df.shape[1] # no.of columns

4

In [65]:
new.sort_values('M') # values under M columns will be sorted

       N      M        S        E
4      E     73       88       82
3      C     75       81       77
5      F     75       88       88
7      H     75       87       90
8      I     78       88       81
9      J     79       98       88
1      A     82       73       76
2      B     82       78       83
6      G     87       72       82
10     K     90       87       74
0   Name  Maths  Science  English

In [68]:
marks_df.sort_values('English')

  Name  Maths  Science  English
9    K     90       87       74
0    A     82       73       76
2    C     75       81       77
7    I     78       88       81
3    E     73       88       82
5    G     87       72       82
1    B     82       78       83
4    F     75       88       88
8    J     79       98       88
6    H     75       87       90

In [70]:
df2=new.sort_values('E',ascending=False) # sorting in reverse order
df2

       N      M        S        E
0   Name  Maths  Science  English
7      H     75       87       90
5      F     75       88       88
9      J     79       98       88
2      B     82       78       83
4      E     73       88       82
6      G     87       72       82
8      I     78       88       81
3      C     75       81       77
1      A     82       73       76
10     K     90       87       74

In [128]:
df['College']='IIIT'

In [129]:
df

       N      M        S        E College
0   Name  Maths  Science  English    IIIT
1      A     82       73       76    IIIT
2      B     82       78       83    IIIT
3      C     75       81       77    IIIT
4      E     73       88       82    IIIT
5      F     75       88       88    IIIT
6      G     87       72       82    IIIT
7      H     75       87      NaN    IIIT
8      I    NaN       88       81    IIIT
9      J     79      NaN       88    IIIT
10     K     90       87       74    IIIT

In [62]:
df['Total']=df['M']+df['S']+df['E']
df # concatenating

       N      M        S        E College                Total
0   Name  Maths  Science  English    IIIT  MathsScienceEnglish
1      A     75       71       85    IIIT               757185
2      B     74       77       79    IIIT               747779
3      C     82       81       86    IIIT               828186
4      E     90       88       73    IIIT               908873
5      F     88       77       86    IIIT               887786
6      G     87       85       75    IIIT               878575
7      H     90       81       71    IIIT               908171
8      I     74       70       87    IIIT               747087
9      J     70       84       82    IIIT               708482
10     K     72       84       71    IIIT               728471

In [138]:
df.sum()

N          Name'Ram''Asha'Roja'Ravi''Suma''Rohan''Raman''...
M                                Maths23454977'906739.344530
E                                  English356649673929346791
College             IIITIIITIIITIIITIIITIIITIIITIIITIIITIIIT
dtype: object

In [130]:
df.sample(4) # randomly seclecting the samples

       N      M        S        E College
6      G     87       72       82    IIIT
10     K     90       87       74    IIIT
0   Name  Maths  Science  English    IIIT
1      A     82       73       76    IIIT

In [69]:
df.nunique() #unique values

N          11
M           9
S           8
E           9
College     1
Total      11
dtype: int64

In [70]:
df.M.value_counts()

90       2
74       2
88       1
82       1
72       1
70       1
75       1
87       1
Maths    1
Name: M, dtype: int64

In [151]:
marks_df['Maths']

0       23
1       45
2       49
3       77
4      '90
5       67
6    39.34
7       45
8       30
Name: Maths, dtype: object

In [73]:
marks_df

  Name  Maths  Science  English
0    A     82       73       76
1    B     82       78       83
2    C     75       81       77
3    E     73       88       82
4    F     75       88       88
5    G     87       72       82
6    H     75       87       90
7    I     78       88       81
8    J     79       98       88
9    K     90       87       74

In [74]:
marks_df.isna()

    Name  Maths  Science  English
0  False  False    False    False
1  False  False    False    False
2  False  False    False    False
3  False  False    False    False
4  False  False    False    False
5  False  False    False    False
6  False  False    False    False
7  False  False    False    False
8  False  False    False    False
9  False  False    False    False

In [133]:
marks_df.isnull().sum()

Name       0
Maths      1
Science    1
English    1
dtype: int64

In [155]:
sc=marks_df.Science
sc

0    45.0
1     NaN
2    45.0
3    89.0
4    56.0
5    82.0
6    78.0
7    34.0
8    58.0
Name: Science, dtype: float64

In [72]:
m=marks_df.Maths
m

0    82
1    82
2    75
3    73
4    75
5    87
6    75
7    78
8    79
9    90
Name: Maths, dtype: int64

In [79]:
marks_df.dropna() # removing None/NaN values

  Name  Maths  Science  English
0    A     75       71       85
1    B     74       77       79
2    C     82       81       86
3    E     90       88       73
4    F     88       77       86
5    G     87       85       75
6    H     90       81       71
7    I     74       70       87
8    J     70       84       82
9    K     72       84       71

In [80]:
df.dropna()

       N      M        S        E College                Total
0   Name  Maths  Science  English    IIIT  MathsScienceEnglish
1      A     75       71       85    IIIT               757185
2      B     74       77       79    IIIT               747779
3      C     82       81       86    IIIT               828186
4      E     90       88       73    IIIT               908873
5      F     88       77       86    IIIT               887786
6      G     87       85       75    IIIT               878575
7      H     90       81       71    IIIT               908171
8      I     74       70       87    IIIT               747087
9      J     70       84       82    IIIT               708482
10     K     72       84       71    IIIT               728471

In [81]:
marks_df.isnull()['Science']

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: Science, dtype: bool

In [21]:
'ruthu'+'apssdc'

'ruthuapssdc'

In [22]:
'df1'+'df2'

'df1df2'

In [134]:
# 123 456 789 904 392 602
# 2+5+8+0+9+0=24
nums=input().split()
s=0
for num in nums:
    s+=int(num[1])
s

123 456 789 392 602

24